import json
import os

def load_config():

    default_config = {
    "token": "7459445022:AAEIZIjZtkQybSZGxXVWIZ3EkRUQVzLz1Hw",
    "admin_id": 949735878,
    "rate": 1.3,
    "messages": {
        "startup_admin": "💎 Stitch Roblox | Купить Робуксы 💎\n\nСтатус обновлен: Онлайн 🟢",
        "startup_user": "Алоха! 👋 Ты попал в лучший магазин по Roblox, выберете любую кнопку для продолжения\n\n✨ Средняя оценка: ⭐️⭐️⭐️⭐️⭐️ (~4.97/5)\n\nStitch Roblox желает лучших покупок! ❤️",
        "top_up": "🔥 Напишите желаемое кол-во RBX для покупки!",
        "top_up_proceed": "🖋 Выберите наиболее удобный для вас способ оплаты ⤵️",
        "top_up_by_card": "📩 Отправьте деньги по реквизитам на банковскую карту:\n☎️ Номер: 0000 0000 0000 0000\n\nОтправляйте без комментариев. Получатель Олег Дмитриевич Ж\n\n💰 Оплачиваете: {rub_amount} RUB\n💵 Получаете: {rbx_amount} RBX\n\n📸 После оплаты, отправь сюда, в чат, скриншот оплаты:",
        "bill_photo_need": "❗️ Отправьте нам скриншот чека.",
        "bill_photo_success": "🙌 Отлично! Ваше пополнение на проверке. Она займет не более 1 часа, обычно до 10 минут.",
        "no_money": "⚠️ Недостаточно баланса. На вашем балансе 0 .",
        "no_payout": "❗️ Вывод работает от 100 RBX.",
        "support": "🧑‍💻 Часто задаваемые вопросы:\n\n1. Почему так долго проверяют чек?\n• Чеки проверяются в ручную, а не автоматически. Сотрудники не смогут проверить чек, если вы пополнили в позднее время или раннее вечером. До 24 часов занимает проверка чека.\n\n2. Почему так долго выводят робуксы?\n• Вывод робуксов занимает до 24 часов. Но мы стараемся как можно быстрее вывести вам робуксы. Возможно сотрудник взял перерыв\n\n3. Сколько по времени выводят робуксы?\n• Вывод робуксов происходит до 24 часов от запроса на вывод. Но в большинстве вывод происходит от нескольких минут до часа.\n\n4. Безопасно ли у вас покупать?\n•Весь товар, который продаётся в боте, получен честным путём. Если вы сомневаетесь в безопасности, то лучше покупать в игре.\n\n💡 Прежде чем задать вопрос, убедитесь что здесь нету ответа на ваш вопрос",
        "support_message": "📩 Напишите свой вопрос в поддержку",
        "support_message_success": "Ожидайте, вам ответят в ближайшее время",
        "profile": "📋 Информация о {tag}\nUID: {uid}\n🆔: {id}\n💸 Денег: 0 руб\n🍪 Робуксов: 0 RBX\n\n\nВаша реферальная ссылка - https://t.me/StitchRobloxBot?start=ref-177.\n\n📤 Отправьте её вашим друзьям. Если Ваш друг зарегистрируется по ссылке и купит у нас робаксы, то вы получите процент с его покупок!\n\n👤 У вас 0 рефералов.",
        "rate": "💹 Курс: {rub} за 1 RBX",
        "news": "📰 Наш новостник - t.me/StitchNew\n\n⚠️ Публикуем исключительно важные новости по боту и Robloxу",
        "link_to_news_for_keyboard": "https://t.me/StitchNew",
        "reviews": "😄 Наши отзывы - t.me/stichReviews\n\n💡 Если у вас есть какие-либо сомнения при покупке голды, то вы можете посмотреть отзывы и убедиться в нашей честности.",
        "link_to_reviews_for_keyboard": "https://t.me/StitchNew",
        "calc": "Выберите вариант ниже ⤵️",
        "calc2": "✍️ Введите сумму (в RUB)",
        "calc1": "✍️ Введите сумму (в RBX)",
        "calc_no_symbole": "⚠️ Введите сумму без лишних символов"
     }
}

    if not os.path.exists('config.json'):
        with open('config.json', 'w', encoding='utf-8') as f:
            json.dump(default_config, f, ensure_ascii=False, indent=4)
    with open('config.json', 'r', encoding='utf-8') as f:
        return json.load(f)

config = load_config()
TOKEN = config['token']
ADMIN_ID = config['admin_id']
MESSAGES = config['messages']
RATE = config['rate']
