startup_message = """
 💎 Хасл Домашка 💎

Статус обновлен: Онлайн 🟢
"""

start_message = """
 💎 <b>Хасл Домашка</b> 💎
 
<u>Быстро, удобно и эффективно!</u>

Начни использовать нашего бота 
сегодня и освободи себе больше 
времени для того, чтобы заниматься 
любимыми занятиями. 

Получи поддержку в учебе с нашим 
Телеграмм ботом уже сейчас!
"""

create_order_message = """
Ты должен будешь указать предмет,
цену, время выполнения, комментарий к выполнению, 
фото задания

Сейчас выбери предмет:
"""

get_time_message = """
Предмет выбран: {}

Напиши желаемое время
получения решеного заказа
(пример: завтра до 15:00)
"""

get_price_message = """
Время получено: {}

Напиши сумму оплаты заказа
(пример: 1500)
"""

get_description_message = """
Сумма заказа: {}

Напиши дополнительный комментарий
по выполнению заказа
"""

get_photo_message = """
Комментарий принят.

Скидывай фотографии заданий
"""

order_accepted_message = """
 💎 <b>Хасл Домашка</b> 💎
 
 Ваш заказ:
 Предмет: {}
 Время: {}
 Сумма заказа: {}
 Комментарий: {}
"""
